app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "author", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "test"], ["body", "test"], ["author", "test"], ["likes", 1], ["created_at", "2024-09-04 02:01:46.001818"], ["updated_at", "2024-09-04 02:01:46.001818"]]
---
  def create
    @post = Post.new(post_params)
    @post.likes = 1

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 2], ["updated_at", "2024-09-04 02:04:23.968773"], ["id", 11]]
---
  def updateLike
    @post = Post.find(params[:id])
    if @post.likes != nil
      @post.likes = @post.likes + 1
    else
      @post.likes = 1
    end

    @post.save